src/InformationRegisters/цур_ПраваДоступа/цур_ПраваДоступа.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>цур_ПраваДоступа</name>
  <resources>
    <name>ЗначениеПрава</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <dimensions>
    <name>Роль</name>
    <type>
      <types>CatalogRef.цур_Роли</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВидОбъекта</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ИмяОбъекта</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ИмяПрава</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ТипРеквизита</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ИмяРеквизита</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ИмяРеквизитаТЧ</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/InformationRegisters/цур_ОграниченияДоступа/цур_ОграниченияДоступа.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>цур_ОграниченияДоступа</name>
  <resources>
    <name>УсловиеОграничения</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <dimensions>
    <name>Роль</name>
    <type>
      <types>CatalogRef.цур_Роли</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВидОбъекта</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ИмяОбъекта</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ИмяПрава</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Поля</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/InformationRegisters/цур_ШаблоныОграничений/цур_ШаблоныОграничений.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>цур_ШаблоныОграничений</name>
  <resources>
    <name>ТекстШаблона</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <dimensions>
    <name>Роль</name>
    <type>
      <types>CatalogRef.цур_Роли</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ИмяШаблона</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/InformationRegisters/цур_ПодсистемыРолей/цур_ПодсистемыРолей.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>цур_ПодсистемыРолей</name>
  <dimensions>
    <name>Роль</name>
    <type>
      <types>CatalogRef.цур_Роли</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ПолноеИмяПодсистемы</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>300</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/InformationRegisters/цур_XMLРолейКонфигурации/цур_XMLРолейКонфигурации.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>цур_XMLРолейКонфигурации</name>
  <resources>
    <name>XMLТекст</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <dimensions>
    <name>ИнформационнаяБаза</name>
    <type>
      <types>CatalogRef.цур_ИнформационныеБазы</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ИмяРоли</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/Catalogs/цур_Роли/цур_Роли.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>цур_Роли</name>
  <hierarchical>true</hierarchical>
  <owners>Catalog.цур_ИнформационныеБазы</owners>
  <attributes>
    <name>ИмяРолиВКонфигурации</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторРоли</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УстанавливатьДляНовыхОбъектов</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УстанавливатьДляРеквизитовПоУмолчанию</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НезависимыеПраваПодчиненных</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Статус</name>
    <type>
      <types>EnumRef.цур_СтатусыРоли</types>
    </type>
  </attributes>
  <attributes>
    <name>ПрофильДоступа</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>300</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ХешСоставаРоли</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>32</length>
      </stringQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

src/CommonModules/цур_МодельРолейСервер/Module.bsl
#Область ПрограммныйИнтерфейс

// Возвращает пустую структуру параметров роли (конструктор модели).
//
// Возвращаемое значение:
//  Структура - шаблон модели роли:
//    * Имя                                   - Строка   - программное имя роли в конфигурации
//    * Синоним                               - Строка   - синоним роли
//    * Комментарий                           - Строка   - комментарий к роли
//    * УстанавливатьДляНовыхОбъектов         - Булево   - флаг setForNewObjects
//    * УстанавливатьДляРеквизитовПоУмолчанию - Булево   - флаг setForAttributesByDefault
//    * НезависимыеПраваПодчиненных           - Булево   - флаг independentRightsOfChildObjects
//    * Права                                 - ТаблицаЗначений - права доступа объектов
//    * Ограничения                           - ТаблицаЗначений - ограничения доступа к данным (RLS)
//    * Шаблоны                               - ТаблицаЗначений - шаблоны ограничений
//    * Подсистемы                            - Массив          - полные имена подсистем
//
Функция НовыеПараметрыРоли() Экспорт

	Модель = Новый Структура;
	Модель.Вставить("Имя",                                   "");
	Модель.Вставить("Синоним",                               "");
	Модель.Вставить("Комментарий",                           "");
	Модель.Вставить("УстанавливатьДляНовыхОбъектов",         Ложь);
	Модель.Вставить("УстанавливатьДляРеквизитовПоУмолчанию", Истина);
	Модель.Вставить("НезависимыеПраваПодчиненных",           Ложь);
	Модель.Вставить("Права",        НоваяТаблицаПрав());
	Модель.Вставить("Ограничения",  НоваяТаблицаОграничений());
	Модель.Вставить("Шаблоны",      НоваяТаблицаШаблонов());
	Модель.Вставить("Подсистемы",   Новый Массив);

	Возврат Модель;

КонецФункции

// Читает данные роли из справочника и четырёх регистров в единую модель.
// Использует пакетный запрос для минимизации обращений к базе.
//
// Параметры:
//  СсылкаРоли - СправочникСсылка.цур_Роли - ссылка на элемент справочника ролей
//
// Возвращаемое значение:
//  Структура - заполненная модель роли, см. НовыеПараметрыРоли()
//
Функция НормализоватьРоль(СсылкаРоли) Экспорт

	Модель = НовыеПараметрыРоли();

	МенеджерВТ = Новый МенеджерВременныхТаблиц;

	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВТ;
	Запрос.УстановитьПараметр("Роль", СсылкаРоли);

	Запрос.Текст =
	"ВЫБРАТЬ
	|	цур_Роли.ИмяРолиВКонфигурации                 КАК ИмяРолиВКонфигурации,
	|	цур_Роли.Наименование                          КАК Наименование,
	|	цур_Роли.Комментарий                           КАК Комментарий,
	|	цур_Роли.УстанавливатьДляНовыхОбъектов         КАК УстанавливатьДляНовыхОбъектов,
	|	цур_Роли.УстанавливатьДляРеквизитовПоУмолчанию КАК УстанавливатьДляРеквизитовПоУмолчанию,
	|	цур_Роли.НезависимыеПраваПодчиненных           КАК НезависимыеПраваПодчиненных
	|ИЗ
	|	Справочник.цур_Роли КАК цур_Роли
	|ГДЕ
	|	цур_Роли.Ссылка = &Роль
	|;
	|
	|ВЫБРАТЬ
	|	РС.ВидОбъекта     КАК ВидОбъекта,
	|	РС.ИмяОбъекта     КАК ИмяОбъекта,
	|	РС.ИмяПрава       КАК ИмяПрава,
	|	РС.ТипРеквизита   КАК ТипРеквизита,
	|	РС.ИмяРеквизита   КАК ИмяРеквизита,
	|	РС.ИмяРеквизитаТЧ КАК ИмяРеквизитаТЧ,
	|	РС.ЗначениеПрава  КАК ЗначениеПрава
	|ИЗ
	|	РегистрСведений.цур_ПраваДоступа КАК РС
	|ГДЕ
	|	РС.Роль = &Роль
	|;
	|
	|ВЫБРАТЬ
	|	РС.ВидОбъекта         КАК ВидОбъекта,
	|	РС.ИмяОбъекта         КАК ИмяОбъекта,
	|	РС.ИмяПрава           КАК ИмяПрава,
	|	РС.УсловиеОграничения КАК УсловиеОграничения,
	|	РС.Поля               КАК Поля
	|ИЗ
	|	РегистрСведений.цур_ОграниченияДоступа КАК РС
	|ГДЕ
	|	РС.Роль = &Роль
	|;
	|
	|ВЫБРАТЬ
	|	РС.ИмяШаблона   КАК ИмяШаблона,
	|	РС.ТекстШаблона КАК ТекстШаблона
	|ИЗ
	|	РегистрСведений.цур_ШаблоныОграничений КАК РС
	|ГДЕ
	|	РС.Роль = &Роль
	|;
	|
	|ВЫБРАТЬ
	|	РС.ПолноеИмяПодсистемы КАК ПолноеИмяПодсистемы
	|ИЗ
	|	РегистрСведений.цур_ПодсистемыРолей КАК РС
	|ГДЕ
	|	РС.Роль = &Роль";

	РезультатыПакета = Запрос.ВыполнитьПакет();

	ЗаполнитьМодельИзЗапроса(Модель, РезультатыПакета);

	Возврат Модель;

КонецФункции

// Проверяет корректность модели роли.
//
// Параметры:
//  МодельРоли - Структура - модель роли, см. НовыеПараметрыРоли()
//
// Возвращаемое значение:
//  Структура - результат валидации:
//    * Успешно - Булево  - Истина, если ошибок не найдено
//    * Ошибки  - Массив  - список строк с описанием найденных ошибок
//
Функция ВалидироватьРоль(МодельРоли) Экспорт

	Ошибки = Новый Массив;

	ПроверитьИмяРоли(МодельРоли.Имя, Ошибки);
	ПроверитьПраваНаДубликаты(МодельРоли.Права, Ошибки);
	ПроверитьВидыМетаданных(МодельРоли.Права, Ошибки);
	ПроверитьВидыМетаданных(МодельРоли.Ограничения, Ошибки);

	Результат = Новый Структура;
	Результат.Вставить("Успешно", Ошибки.Количество() = 0);
	Результат.Вставить("Ошибки",  Ошибки);

	Возврат Результат;

КонецФункции

// Нормализует и валидирует пакет ролей одним запросом к базе данных.
// Вместо N*5 запросов выполняет 1 пакетный запрос для всего набора ролей.
//
// Параметры:
//  МассивСсылокРолей - Массив - массив СправочникСсылка.цур_Роли
//
// Возвращаемое значение:
//  Массив - массив структур-моделей ролей (только успешно прошедших валидацию)
//
Функция ПодготовитьПакетРолей(МассивСсылокРолей) Экспорт

	Если МассивСсылокРолей.Количество() = 0 Тогда
		Возврат Новый Массив;
	КонецЕсли;

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("СписокРолей", МассивСсылокРолей);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Роли.Ссылка                            КАК Ссылка,
	|	Роли.Наименование                      КАК Наименование,
	|	Роли.ИмяРолиВКонфигурации              КАК ИмяРолиВКонфигурации,
	|	Роли.Комментарий                       КАК Комментарий,
	|	Роли.УстанавливатьДляНовыхОбъектов     КАК УстанавливатьДляНовыхОбъектов,
	|	Роли.УстанавливатьДляРеквизитовПоУмолчанию КАК УстанавливатьДляРеквизитовПоУмолчанию,
	|	Роли.НезависимыеПраваПодчиненных       КАК НезависимыеПраваПодчиненных
	|ИЗ
	|	Справочник.цур_Роли КАК Роли
	|ГДЕ
	|	Роли.Ссылка В (&СписокРолей)
	|;
	|ВЫБРАТЬ
	|	Права.Роль            КАК Роль,
	|	Права.ВидОбъекта      КАК ВидОбъекта,
	|	Права.ИмяОбъекта      КАК ИмяОбъекта,
	|	Права.ИмяПрава        КАК ИмяПрава,
	|	Права.ТипРеквизита    КАК ТипРеквизита,
	|	Права.ИмяРеквизита    КАК ИмяРеквизита,
	|	Права.ИмяРеквизитаТЧ  КАК ИмяРеквизитаТЧ,
	|	Права.ЗначениеПрава   КАК ЗначениеПрава
	|ИЗ
	|	РегистрСведений.цур_ПраваДоступа КАК Права
	|ГДЕ
	|	Права.Роль В (&СписокРолей)
	|;
	|ВЫБРАТЬ
	|	Ограничения.Роль               КАК Роль,
	|	Ограничения.ВидОбъекта         КАК ВидОбъекта,
	|	Ограничения.ИмяОбъекта         КАК ИмяОбъекта,
	|	Ограничения.ИмяПрава           КАК ИмяПрава,
	|	Ограничения.УсловиеОграничения КАК УсловиеОграничения,
	|	Ограничения.Поля               КАК Поля
	|ИЗ
	|	РегистрСведений.цур_ОграниченияДоступа КАК Ограничения
	|ГДЕ
	|	Ограничения.Роль В (&СписокРолей)
	|;
	|ВЫБРАТЬ
	|	Шаблоны.Роль          КАК Роль,
	|	Шаблоны.ИмяШаблона    КАК ИмяШаблона,
	|	Шаблоны.ТекстШаблона  КАК ТекстШаблона
	|ИЗ
	|	РегистрСведений.цур_ШаблоныОграничений КАК Шаблоны
	|ГДЕ
	|	Шаблоны.Роль В (&СписокРолей)
	|;
	|ВЫБРАТЬ
	|	Подсистемы.Роль                КАК Роль,
	|	Подсистемы.ПолноеИмяПодсистемы КАК ПолноеИмяПодсистемы
	|ИЗ
	|	РегистрСведений.цур_ПодсистемыРолей КАК Подсистемы
	|ГДЕ
	|	Подсистемы.Роль В (&СписокРолей)";

	РезультатыПакета = Запрос.ВыполнитьПакет();

	// Индексы для группировки данных по ссылке роли: Соответствие<Ссылка, ТаблицаЗначений>
	ИндексПрав        = СгруппироватьВыборкуПоРоли(РезультатыПакета[1]);
	ИндексОграничений = СгруппироватьВыборкуПоРоли(РезультатыПакета[2]);
	ИндексШаблонов    = СгруппироватьВыборкуПоРоли(РезультатыПакета[3]);
	ИндексПодсистем   = СгруппироватьВыборкуПоРоли(РезультатыПакета[4]);

	// Собрать модели по данным справочника
	МассивМоделей = Новый Массив;

	ВыборкаРолей = РезультатыПакета[0].Выбрать();
	Пока ВыборкаРолей.Следующий() Цикл

		Модель = СобратьМодельИзИндексов(
			ВыборкаРолей,
			ИндексПрав,
			ИндексОграничений,
			ИндексШаблонов,
			ИндексПодсистем);

		МассивМоделей.Добавить(Модель);

	КонецЦикла;

	Возврат МассивМоделей;

КонецФункции

// Читает XML прав из регистра цур_XMLРолейКонфигурации и заполняет регистры прав,
// ограничений и шаблонов для указанной роли.
//
// Параметры:
//  СсылкаРоли          - СправочникСсылка.цур_Роли - ссылка на роль в справочнике
//  ИмяРолиКонфигурации - Строка - имя роли в конфигурации (ключ регистра цур_XMLРолейКонфигурации)
//
Процедура ЗаполнитьПраваИзРолиКонфигурации(СсылкаРоли, ИмяРолиКонфигурации) Экспорт

	XMLТекст = ПолучитьXMLРолиИзРегистра(ИмяРолиКонфигурации);

	Если ПустаяСтрока(XMLТекст) Тогда
		ВызватьИсключение НСтр("ru = 'XML текст роли не найден в регистре цур_XMLРолейКонфигурации.'");
	КонецЕсли;

	Модель = НовыеПараметрыРоли();
	ПрочитатьМодельИзXML(ИмяРолиКонфигурации, XMLТекст, Модель);

	ЗаписатьПраваРоли(
		СсылкаРоли,
		Модель.Права,
		Модель.Ограничения,
		Модель.Шаблоны,
		Модель.Подсистемы);

КонецПроцедуры

// Собирает права из всех ролей пользователя ИБ и записывает их для роли-агрегата.
// Объединение прав выполняется по правилу OR (право = Истина, если хотя бы одна роль разрешает).
//
// Параметры:
//  СсылкаРоли      - СправочникСсылка.цур_Роли - ссылка на роль-агрегат
//  ИмяПользователя - Строка - имя пользователя информационной базы
//
Процедура ЗаполнитьПраваИзПользователя(СсылкаРоли, ИмяПользователя) Экспорт

	ПользовательИБ = ПользователиИнформационнойБазы.НайтиПоИмени(ИмяПользователя);
	Если ПользовательИБ = Неопределено Тогда
		ВызватьИсключение СтрШаблон(
			НСтр("ru = 'Пользователь ""%1"" не найден.'"),
			ИмяПользователя);
	КонецЕсли;

	МассивРолей = Новый Массив;
	Для Каждого Роль Из ПользовательИБ.Роли Цикл
		МассивРолей.Добавить(Роль.Имя);
	КонецЦикла;

	МодельАгрегат = ОбъединитьПраваРолей(МассивРолей);

	ЗаписатьПраваРоли(
		СсылкаРоли,
		МодельАгрегат.Права,
		МодельАгрегат.Ограничения,
		МодельАгрегат.Шаблоны,
		МодельАгрегат.Подсистемы);

КонецПроцедуры

// Собирает права из ролей профиля (по имени профиля) и записывает их для роли-агрегата.
// Объединение прав выполняется по правилу OR.
// Поиск профиля выполняется через справочник ПрофилиГруппДоступа (при наличии)
// или интерпретируется как имя роли конфигурации (без БСП).
//
// Параметры:
//  СсылкаРоли - СправочникСсылка.цур_Роли - ссылка на роль-агрегат
//  ИмяПрофиля - Строка - строковое имя профиля
//
Процедура ЗаполнитьПраваИзПрофиля(СсылкаРоли, СсылкаПрофиля) Экспорт

	МассивРолей = ПолучитьРолиПрофиля(СсылкаПрофиля);

	Если МассивРолей.Количество() = 0 Тогда
		ВызватьИсключение СтрШаблон(
			НСтр("ru = 'Профиль ""%1"" не содержит ролей или не найден.'"),
			СсылкаПрофиля);
	КонецЕсли;

	МодельАгрегат = ОбъединитьПраваРолей(МассивРолей);

	ЗаписатьПраваРоли(
		СсылкаРоли,
		МодельАгрегат.Права,
		МодельАгрегат.Ограничения,
		МодельАгрегат.Шаблоны,
		МодельАгрегат.Подсистемы);

КонецПроцедуры

// Очищает старые записи и записывает новые права роли в регистры в рамках одной транзакции.
//
// ВАЖНО: Вызывающий код обязан предварительно провалидировать данные через ВалидироватьРоль().
//
// Параметры:
//  СсылкаРоли         - СправочникСсылка.цур_Роли - ссылка на роль
//  ТаблицаПрав        - ТаблицаЗначений - права доступа (колонки: ВидОбъекта, ИмяОбъекта,
//                       ИмяПрава, ТипРеквизита, ИмяРеквизита, ИмяРеквизитаТЧ, ЗначениеПрава)
//  ТаблицаОграничений - ТаблицаЗначений - ограничения (колонки: ВидОбъекта, ИмяОбъекта,
//                       ИмяПрава, УсловиеОграничения)
//  ТаблицаШаблонов    - ТаблицаЗначений - шаблоны (колонки: ИмяШаблона, ТекстШаблона)
//  МассивПодсистем    - Массив - массив строк с полными именами подсистем
//
Процедура ЗаписатьПраваРоли(
		СсылкаРоли,
		ТаблицаПрав,
		ТаблицаОграничений,
		ТаблицаШаблонов,
		МассивПодсистем) Экспорт

	НачатьТранзакцию();
	Попытка

		ЗаписатьТаблицуВРегистрПрав(СсылкаРоли, ТаблицаПрав);
		ЗаписатьТаблицуВРегистрОграничений(СсылкаРоли, ТаблицаОграничений);
		ЗаписатьТаблицуВРегистрШаблонов(СсылкаРоли, ТаблицаШаблонов);
		ЗаписатьПодсистемыРоли(СсылкаРоли, МассивПодсистем);

		ЗафиксироватьТранзакцию();

	Исключение
		ОтменитьТранзакцию();
		ВызватьИсключение;
	КонецПопытки;

КонецПроцедуры

// Возвращает модель прав роли конфигурации без записи в регистры.
// Используется для заполнения дерева формы напрямую.
//
// Параметры:
//  ИмяРолиКонфигурации - Строка - имя роли в конфигурации (ключ регистра цур_XMLРолейКонфигурации)
//
// Возвращаемое значение:
//  Структура - модель роли, см. НовыеПараметрыРоли()
//
Функция ПолучитьМодельРолиКонфигурации(ИмяРолиКонфигурации) Экспорт

	XMLТекст = ПолучитьXMLРолиИзРегистра(ИмяРолиКонфигурации);

	Если ПустаяСтрока(XMLТекст) Тогда
		ВызватьИсключение НСтр("ru = 'XML текст роли не найден в регистре цур_XMLРолейКонфигурации.'");
	КонецЕсли;

	Модель = НовыеПараметрыРоли();
	ПрочитатьМодельИзXML(ИмяРолиКонфигурации, XMLТекст, Модель);

	Возврат Модель;

КонецФункции

// Возвращает объединённую модель прав из ролей профиля без записи в регистры.
//
// Параметры:
//  СсылкаПрофиля - СправочникСсылка - ссылка на профиль групп доступа
//
// Возвращаемое значение:
//  Структура - модель роли, см. НовыеПараметрыРоли()
//
Функция ПолучитьМодельПрофиля(СсылкаПрофиля) Экспорт

	МассивРолей = ПолучитьРолиПрофиля(СсылкаПрофиля);

	Если МассивРолей.Количество() = 0 Тогда
		ВызватьИсключение СтрШаблон(
			НСтр("ru = 'Профиль ""%1"" не содержит ролей или не найден.'"),
			СсылкаПрофиля);
	КонецЕсли;

	Возврат ОбъединитьПраваРолей(МассивРолей);

КонецФункции

// Возвращает объединённую модель прав из ролей пользователя ИБ без записи в регистры.
//
// Параметры:
//  ИмяПользователя - Строка - имя пользователя информационной базы
//
// Возвращаемое значение:
//  Структура - модель роли, см. НовыеПараметрыРоли()
//
Функция ПолучитьМодельПользователя(ИмяПользователя) Экспорт

	ПользовательИБ = ПользователиИнформационнойБазы.НайтиПоИмени(ИмяПользователя);

	Если ПользовательИБ = Неопределено Тогда
		ВызватьИсключение СтрШаблон(
			НСтр("ru = 'Пользователь ""%1"" не найден.'"),
			ИмяПользователя);
	КонецЕсли;

	МассивРолей = Новый Массив;

	Для Каждого Роль Из ПользовательИБ.Роли Цикл
		МассивРолей.Добавить(Роль.Имя);
	КонецЦикла;

	Возврат ОбъединитьПраваРолей(МассивРолей);

КонецФункции

// Возвращает объединённую модель прав пользователя на основе профилей групп доступа БСП.
// Цепочка: Пользователь → ГруппыДоступа (ТЧ Пользователи) → Профиль → Роли профиля.
//
// Параметры:
//  СсылкаПользователя - СправочникСсылка - ссылка на элемент справочника Пользователи
//
// Возвращаемое значение:
//  Структура - модель роли, см. НовыеПараметрыРоли()
//
Функция ПолучитьМодельПользователяБСП(СсылкаПользователя) Экспорт

	Если Метаданные.НайтиПоПолномуИмени("Справочник.ГруппыДоступа") = Неопределено Тогда
		ВызватьИсключение НСтр("ru = 'Справочник ""ГруппыДоступа"" не найден. Подсистема управления доступом БСП не подключена.'");
	КонецЕсли;

	МассивРолей = ПолучитьРолиПользователяЧерезПрофили(СсылкаПользователя);

	Если МассивРолей.Количество() = 0 Тогда
		ВызватьИсключение НСтр("ru = 'У пользователя нет ролей через профили групп доступа.'");
	КонецЕсли;

	Возврат ОбъединитьПраваРолей(МассивРолей);

КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Создаёт пустую таблицу значений для хранения прав доступа объектов.
Функция НоваяТаблицаПрав()

	ТипС50  = Новый ОписаниеТипов("Строка", , Новый КвалификаторыСтроки(50));
	ТипС150 = Новый ОписаниеТипов("Строка", , Новый КвалификаторыСтроки(150));
	ТипБул  = Новый ОписаниеТипов("Булево");

	Таблица = Новый ТаблицаЗначений;
	Таблица.Колонки.Добавить("ВидОбъекта",      ТипС50);
	Таблица.Колонки.Добавить("ИмяОбъекта",      ТипС150);
	Таблица.Колонки.Добавить("ИмяПрава",        ТипС50);
	Таблица.Колонки.Добавить("ТипРеквизита",    ТипС50);
	Таблица.Колонки.Добавить("ИмяРеквизита",    ТипС150);
	Таблица.Колонки.Добавить("ИмяРеквизитаТЧ",  ТипС150);
	Таблица.Колонки.Добавить("ЗначениеПрава",   ТипБул);
	Возврат Таблица;

КонецФункции

// Создаёт пустую таблицу значений для хранения ограничений доступа (RLS).
Функция НоваяТаблицаОграничений()

	ТипС50       = Новый ОписаниеТипов("Строка", , Новый КвалификаторыСтроки(50));
	ТипС150      = Новый ОписаниеТипов("Строка", , Новый КвалификаторыСтроки(150));
	ТипСтрока    = Новый ОписаниеТипов("Строка");

	Таблица = Новый ТаблицаЗначений;
	Таблица.Колонки.Добавить("ВидОбъекта",        ТипС50);
	Таблица.Колонки.Добавить("ИмяОбъекта",        ТипС150);
	Таблица.Колонки.Добавить("ИмяПрава",          ТипС50);
	Таблица.Колонки.Добавить("УсловиеОграничения", ТипСтрока);
	Таблица.Колонки.Добавить("Поля",              ТипСтрока);
	Возврат Таблица;

КонецФункции

// Создаёт пустую таблицу значений для хранения шаблонов ограничений.
Функция НоваяТаблицаШаблонов()

	ТипС150   = Новый ОписаниеТипов("Строка", , Новый КвалификаторыСтроки(150));
	ТипСтрока = Новый ОписаниеТипов("Строка");

	Таблица = Новый ТаблицаЗначений;
	Таблица.Колонки.Добавить("ИмяШаблона",   ТипС150);
	Таблица.Колонки.Добавить("ТекстШаблона", ТипСтрока);
	Возврат Таблица;

КонецФункции

// Заполняет поля модели из результатов пакетного запроса (5 запросов).
//
// Параметры:
//  Модель           - Структура                   - модель роли для заполнения
//  РезультатыПакета - МассивРезультатовЗапроса - массив из 5 результатов:
//                     [0] - справочник цур_Роли,
//                     [1] - регистр цур_ПраваДоступа,
//                     [2] - регистр цур_ОграниченияДоступа,
//                     [3] - регистр цур_ШаблоныОграничений,
//                     [4] - регистр цур_ПодсистемыРолей
//
Процедура ЗаполнитьМодельИзЗапроса(Модель, РезультатыПакета)

	// Запрос 0: реквизиты справочника
	Если Не РезультатыПакета[0].Пустой() Тогда
		Выборка = РезультатыПакета[0].Выбрать();
		Выборка.Следующий();
		Модель.Имя                                    = Выборка.ИмяРолиВКонфигурации;
		Модель.Синоним                                = Выборка.Наименование;
		Модель.Комментарий                            = Выборка.Комментарий;
		Модель.УстанавливатьДляНовыхОбъектов          = Выборка.УстанавливатьДляНовыхОбъектов;
		Модель.УстанавливатьДляРеквизитовПоУмолчанию  = Выборка.УстанавливатьДляРеквизитовПоУмолчанию;
		Модель.НезависимыеПраваПодчиненных             = Выборка.НезависимыеПраваПодчиненных;
	КонецЕсли;

	// Запросы 1-3: выгрузка в таблицы значений
	Модель.Права        = РезультатыПакета[1].Выгрузить();
	Модель.Ограничения  = РезультатыПакета[2].Выгрузить();
	Модель.Шаблоны      = РезультатыПакета[3].Выгрузить();

	// Запрос 4: подсистемы
	ВыборкаПодсистем = РезультатыПакета[4].Выбрать();
	Пока ВыборкаПодсистем.Следующий() Цикл
		Модель.Подсистемы.Добавить(ВыборкаПодсистем.ПолноеИмяПодсистемы);
	КонецЦикла;

КонецПроцедуры

// Проверяет имя роли: должно быть заполнено и содержать только латинские буквы, цифры и знак _.
Процедура ПроверитьИмяРоли(ИмяРоли, Ошибки)

	Если ПустаяСтрока(ИмяРоли) Тогда
		Ошибки.Добавить(НСтр("ru = 'Не заполнено имя роли в конфигурации.'"));
		Возврат;
	КонецЕсли;

	Для Ном = 1 По СтрДлина(ИмяРоли) Цикл
		Символ     = Сред(ИмяРоли, Ном, 1);
		КодСимвола = КодСимвола(Символ);

		ЭтоБукваЛат      = (КодСимвола >= 65 И КодСимвола <= 90)
			Или (КодСимвола >= 97 И КодСимвола <= 122);
		ЭтоЦифра         = КодСимвола >= 48 И КодСимвола <= 57;
		ЭтоПодчеркивание = КодСимвола = 95;

		Если Не (ЭтоБукваЛат Или ЭтоЦифра Или ЭтоПодчеркивание) Тогда
			Ошибки.Добавить(СтрШаблон(
				НСтр("ru = 'Имя роли ""%1"" содержит недопустимый символ ""%2"" (позиция %3).'"),
				ИмяРоли, Символ, Ном));
			Возврат;
		КонецЕсли;

	КонецЦикла;

КонецПроцедуры

// Проверяет отсутствие дублирующихся записей прав по ключу ВидОбъекта+ИмяОбъекта+ИмяПрава+ТипРеквизита+ИмяРеквизита.
Процедура ПроверитьПраваНаДубликаты(ТаблицаПрав, Ошибки)

	ИндексДубликатов = Новый Соответствие;

	Для Каждого Строка Из ТаблицаПрав Цикл
		Ключ = СтрШаблон("%1|%2|%3|%4|%5",
			Строка.ВидОбъекта,
			Строка.ИмяОбъекта,
			Строка.ИмяПрава,
			Строка.ТипРеквизита,
			Строка.ИмяРеквизита);

		Если ИндексДубликатов.Получить(Ключ) <> Неопределено Тогда
			Ошибки.Добавить(СтрШаблон(
				НСтр("ru = 'Дублирующееся право: объект ""%1.%2"", право ""%3"".'"),
				Строка.ВидОбъекта, Строка.ИмяОбъекта, Строка.ИмяПрава));
		Иначе
			ИндексДубликатов.Вставить(Ключ, Истина);
		КонецЕсли;

	КонецЦикла;

КонецПроцедуры

// Проверяет, что виды метаданных из таблицы прав/ограничений существуют в реестре.
// Ожидает колонку ВидОбъекта в таблице.
//
// Параметры:
//  Таблица - ТаблицаЗначений - таблица прав или ограничений
//  Ошибки  - Массив          - массив строк для добавления найденных ошибок
//
Процедура ПроверитьВидыМетаданных(Таблица, Ошибки)

	МассивВидов = цур_РеестрМетаданныхСерверПовтИсп.ВсеВидыМетаданных();

	ДопустимыеВиды = Новый Соответствие;
	Для Каждого Вид Из МассивВидов Цикл
		ДопустимыеВиды.Вставить(Вид.ВидМетаданных, Истина);
	КонецЦикла;

	ПроверенныеВиды = Новый Соответствие;

	Для Каждого Строка Из Таблица Цикл
		ВидОбъекта = Строка.ВидОбъекта;

		Если ПустаяСтрока(ВидОбъекта) Тогда
			Продолжить;
		КонецЕсли;

		Если ПроверенныеВиды.Получить(ВидОбъекта) <> Неопределено Тогда
			Продолжить;
		КонецЕсли;

		ПроверенныеВиды.Вставить(ВидОбъекта, Истина);

		Если ДопустимыеВиды.Получить(ВидОбъекта) = Неопределено Тогда
			Ошибки.Добавить(СтрШаблон(
				НСтр("ru = 'Вид метаданных ""%1"" не найден в реестре видов метаданных.'"),
				ВидОбъекта));
		КонецЕсли;

	КонецЦикла;

КонецПроцедуры

// Группирует выборку результата запроса по колонке Роль.
// Возвращает Соответствие<СправочникСсылка.цур_Роли, ТаблицаЗначений>.
// Используется для O(1)-доступа при сборке пакетных моделей.
//
// Параметры:
//  РезультатЗапроса - РезультатЗапроса - результат запроса с колонкой Роль
//
// Возвращаемое значение:
//  Соответствие - ключ: ссылка на роль, значение: таблица строк этой роли
//
Функция СгруппироватьВыборкуПоРоли(РезультатЗапроса)

	Индекс    = Новый Соответствие;
	Выгрузка  = РезультатЗапроса.Выгрузить();

	Для Каждого Строка Из Выгрузка Цикл

		Ссылка = Строка.Роль;
		ТаблицаРоли = Индекс.Получить(Ссылка);

		Если ТаблицаРоли = Неопределено Тогда
			ТаблицаРоли = Выгрузка.СкопироватьКолонки();
			Индекс.Вставить(Ссылка, ТаблицаРоли);
		КонецЕсли;

		ЗаполнитьЗначенияСвойств(ТаблицаРоли.Добавить(), Строка);

	КонецЦикла;

	Возврат Индекс;

КонецФункции

// Собирает модель роли из предварительно сгруппированных индексов пакетного запроса.
// Ожидает, что курсор ВыборкаРолей уже позиционирован на нужной строке.
//
// Параметры:
//  ВыборкаРолей      - ВыборкаИзРезультатаЗапроса - текущая строка справочника
//  ИндексПрав        - Соответствие - сгруппированные права по ссылке роли
//  ИндексОграничений - Соответствие - сгруппированные ограничения по ссылке роли
//  ИндексШаблонов    - Соответствие - сгруппированные шаблоны по ссылке роли
//  ИндексПодсистем   - Соответствие - сгруппированные подсистемы по ссылке роли
//
// Возвращаемое значение:
//  Структура - заполненная модель роли, см. НовыеПараметрыРоли()
//
Функция СобратьМодельИзИндексов(
		ВыборкаРолей,
		ИндексПрав,
		ИндексОграничений,
		ИндексШаблонов,
		ИндексПодсистем)

	Модель = НовыеПараметрыРоли();

	Модель.Имя                                   = ВыборкаРолей.ИмяРолиВКонфигурации;
	Модель.Синоним                               = ВыборкаРолей.Наименование;
	Модель.Комментарий                           = ВыборкаРолей.Комментарий;
	Модель.УстанавливатьДляНовыхОбъектов         = ВыборкаРолей.УстанавливатьДляНовыхОбъектов;
	Модель.УстанавливатьДляРеквизитовПоУмолчанию = ВыборкаРолей.УстанавливатьДляРеквизитовПоУмолчанию;
	Модель.НезависимыеПраваПодчиненных           = ВыборкаРолей.НезависимыеПраваПодчиненных;

	Ссылка = ВыборкаРолей.Ссылка;

	ТаблицаПрав = ИндексПрав.Получить(Ссылка);
	Если ТаблицаПрав <> Неопределено Тогда
		Модель.Права = ТаблицаПрав;
	КонецЕсли;

	ТаблицаОграничений = ИндексОграничений.Получить(Ссылка);
	Если ТаблицаОграничений <> Неопределено Тогда
		Модель.Ограничения = ТаблицаОграничений;
	КонецЕсли;

	ТаблицаШаблонов = ИндексШаблонов.Получить(Ссылка);
	Если ТаблицаШаблонов <> Неопределено Тогда
		Модель.Шаблоны = ТаблицаШаблонов;
	КонецЕсли;

	СтрокиПодсистем = ИндексПодсистем.Получить(Ссылка);
	Если СтрокиПодсистем <> Неопределено Тогда
		Для Каждого СтрокаПодсистемы Из СтрокиПодсистем Цикл
			Модель.Подсистемы.Добавить(СтрокаПодсистемы.ПолноеИмяПодсистемы);
		КонецЦикла;
	КонецЕсли;

	Возврат Модель;

КонецФункции

// Читает XML текст всех ролей из регистра цур_XMLРолейКонфигурации одним запросом.
//
// Параметры:
//  МассивИмен - Массив - массив строк с именами ролей конфигурации
//
// Возвращаемое значение:
//  Соответствие - ключ: имя роли (Строка), значение: XML текст (Строка)
//
Функция ПолучитьXMLРолейПакетом(МассивИмен)

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	XMLРолей.ИмяРоли  КАК ИмяРоли,
	|	XMLРолей.XMLТекст КАК XMLТекст
	|ИЗ
	|	РегистрСведений.цур_XMLРолейКонфигурации КАК XMLРолей
	|ГДЕ
	|	XMLРолей.ИмяРоли В (&МассивИмен)";
	Запрос.УстановитьПараметр("МассивИмен", МассивИмен);

	РезультатЗапроса = Запрос.Выполнить();
	Выборка          = РезультатЗапроса.Выбрать();

	СоответствиеXML = Новый Соответствие;
	Пока Выборка.Следующий() Цикл
		СоответствиеXML.Вставить(Выборка.ИмяРоли, Выборка.XMLТекст);
	КонецЦикла;

	Возврат СоответствиеXML;

КонецФункции

// Получает XML текст роли из регистра цур_XMLРолейКонфигурации по имени роли.
//
// Параметры:
//  ИмяРоли - Строка - имя роли в конфигурации
//
// Возвращаемое значение:
//  Строка - XML текст прав роли или пустая строка, если запись не найдена
//
Функция ПолучитьXMLРолиИзРегистра(ИмяРоли)

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	РС.XMLТекст КАК XMLТекст
	|ИЗ
	|	РегистрСведений.цур_XMLРолейКонфигурации КАК РС
	|ГДЕ
	|	РС.ИмяРоли = &ИмяРоли";
	Запрос.УстановитьПараметр("ИмяРоли", ИмяРоли);

	РезультатЗапроса = Запрос.Выполнить();

	Если РезультатЗапроса.Пустой() Тогда
		Возврат "";
	КонецЕсли;

	Выборка = РезультатЗапроса.Выбрать();
	Выборка.Следующий();
	Возврат Выборка.XMLТекст;

КонецФункции

// Разбирает XML прав роли (содержимое Rights.xml) и заполняет модель.
//
// Параметры:
//  ИмяРоли  - Строка    - имя роли (используется в контексте разбора)
//  XMLТекст - Строка    - текст XML файла прав (Rights.xml)
//  Модель   - Структура - модель роли для заполнения (Права, Ограничения, Шаблоны, флаги)
//
Процедура ПрочитатьМодельИзXML(ИмяРоли, XMLТекст, Модель)

	ЧтениеXML = Новый ЧтениеXML;
	ЧтениеXML.УстановитьСтроку(XMLТекст);

	Пока ЧтениеXML.Прочитать() Цикл

		Если ЧтениеXML.ТипУзла <> ТипУзлаXML.НачалоЭлемента Тогда
			Продолжить;
		КонецЕсли;

		Если ЧтениеXML.Имя = "setForNewObjects" Тогда
			Модель.УстанавливатьДляНовыхОбъектов = ПрочитатьФлагXML(ЧтениеXML);

		ИначеЕсли ЧтениеXML.Имя = "setForAttributesByDefault" Тогда
			Модель.УстанавливатьДляРеквизитовПоУмолчанию = ПрочитатьФлагXML(ЧтениеXML);

		ИначеЕсли ЧтениеXML.Имя = "independentRightsOfChildObjects" Тогда
			Модель.НезависимыеПраваПодчиненных = ПрочитатьФлагXML(ЧтениеXML);

		ИначеЕсли ЧтениеXML.Имя = "object" Тогда
			ПрочитатьОбъектXML(ЧтениеXML, Модель);

		ИначеЕсли ЧтениеXML.Имя = "restrictionTemplate" Тогда
			ПрочитатьШаблонXML(ЧтениеXML, Модель);

		Иначе
			// Прочие элементы верхнего уровня игнорируем

		КонецЕсли;

	КонецЦикла;

	ЧтениеXML.Закрыть();

КонецПроцедуры

// Читает текстовое значение булева флага из текущего элемента XML.
// Ожидаемый формат: <имяЭлемента>true</имяЭлемента> или <имяЭлемента>false</имяЭлемента>.
//
// Параметры:
//  ЧтениеXML - ЧтениеXML - позиционировано на НачалоЭлемента нужного тега
//
// Возвращаемое значение:
//  Булево
//
Функция ПрочитатьФлагXML(ЧтениеXML)

	Если ЧтениеXML.Прочитать() И ЧтениеXML.ТипУзла = ТипУзлаXML.Текст Тогда
		Возврат НРег(ЧтениеXML.Значение) = "true";
	КонецЕсли;

	Возврат Ложь;

КонецФункции

// Разбирает блок <object> из Rights.xml и добавляет строки в таблицы прав и ограничений.
//
// Dot-нотация имени объекта:
//   ТипОбъекта.ИмяОбъекта[.ТипВложенного.ИмяВложенного]
//
Процедура ПрочитатьОбъектXML(ЧтениеXML, Модель)

	ВидОбъекта     = "";
	ИмяОбъекта     = "";
	ТипРеквизита   = "";
	ИмяРеквизита   = "";
	ИмяРеквизитаТЧ = "";

	Пока ЧтениеXML.Прочитать() Цикл

		Если ЧтениеXML.ТипУзла = ТипУзлаXML.КонецЭлемента И ЧтениеXML.Имя = "object" Тогда
			Прервать;
		КонецЕсли;

		Если ЧтениеXML.ТипУзла <> ТипУзлаXML.НачалоЭлемента Тогда
			Продолжить;
		КонецЕсли;

		Если ЧтениеXML.Имя = "name" Тогда
			ЧтениеXML.Прочитать();
			РазобратьДотНотацию(
				ЧтениеXML.Значение,
				ВидОбъекта, ИмяОбъекта, ТипРеквизита, ИмяРеквизита, ИмяРеквизитаТЧ);

		ИначеЕсли ЧтениеXML.Имя = "right" Тогда
			ПрочитатьПравоXML(
				ЧтениеXML, Модель,
				ВидОбъекта, ИмяОбъекта, ТипРеквизита, ИмяРеквизита, ИмяРеквизитаТЧ);

		Иначе
			// Прочие элементы объекта игнорируем

		КонецЕсли;

	КонецЦикла;

КонецПроцедуры

// Разбирает блок <right> внутри <object> и добавляет строки прав и ограничений в модель.
Процедура ПрочитатьПравоXML(
		ЧтениеXML,
		Модель,
		ВидОбъекта,
		ИмяОбъекта,
		ТипРеквизита,
		ИмяРеквизита,
		ИмяРеквизитаТЧ)

	ИмяПрава          = "";
	ЗначениеПрава     = Ложь;
	ДанныеОграничения = Неопределено;

	Пока ЧтениеXML.Прочитать() Цикл

		Если ЧтениеXML.ТипУзла = ТипУзлаXML.КонецЭлемента И ЧтениеXML.Имя = "right" Тогда
			Прервать;
		КонецЕсли;

		Если ЧтениеXML.ТипУзла <> ТипУзлаXML.НачалоЭлемента Тогда
			Продолжить;
		КонецЕсли;

		Если ЧтениеXML.Имя = "name" Тогда
			ЧтениеXML.Прочитать();
			ИмяПрава = ЧтениеXML.Значение;

		ИначеЕсли ЧтениеXML.Имя = "value" Тогда
			ЧтениеXML.Прочитать();
			ЗначениеПрава = (НРег(ЧтениеXML.Значение) = "true");

		ИначеЕсли ЧтениеXML.Имя = "restrictionByCondition" Тогда
			ДанныеОграничения = ПрочитатьУсловиеОграничения(ЧтениеXML);

		Иначе
			// Прочие элементы внутри <right> игнорируем

		КонецЕсли;

	КонецЦикла;

	НоваяСтрока = Модель.Права.Добавить();
	НоваяСтрока.ВидОбъекта     = ВидОбъекта;
	НоваяСтрока.ИмяОбъекта     = ИмяОбъекта;
	НоваяСтрока.ИмяПрава       = ИмяПрава;
	НоваяСтрока.ТипРеквизита   = ТипРеквизита;
	НоваяСтрока.ИмяРеквизита   = ИмяРеквизита;
	НоваяСтрока.ИмяРеквизитаТЧ = ИмяРеквизитаТЧ;
	НоваяСтрока.ЗначениеПрава  = ЗначениеПрава;

	Если ДанныеОграничения <> Неопределено
			И НЕ ПустаяСтрока(ДанныеОграничения.Условие) Тогда
		НовоеОграничение = Модель.Ограничения.Добавить();
		НовоеОграничение.ВидОбъекта         = ВидОбъекта;
		НовоеОграничение.ИмяОбъекта         = ИмяОбъекта;
		НовоеОграничение.ИмяПрава           = ИмяПрава;
		НовоеОграничение.УсловиеОграничения = ДанныеОграничения.Условие;
		НовоеОграничение.Поля               = ДанныеОграничения.Поля;
	КонецЕсли;

КонецПроцедуры

// Читает условие ограничения доступа из блока <restrictionByCondition>.
//
// Возвращаемое значение:
//  Структура:
//    * Условие - Строка - текст условия ограничения
//    * Поля    - Строка - поля ограничения, разделённые переносом строки
//
Функция ПрочитатьУсловиеОграничения(ЧтениеXML)

	Условие    = "";
	МассивПолей = Новый Массив;

	Пока ЧтениеXML.Прочитать() Цикл

		Если ЧтениеXML.ТипУзла = ТипУзлаXML.КонецЭлемента
				И ЧтениеXML.Имя = "restrictionByCondition" Тогда
			Прервать;
		ИначеЕсли ЧтениеXML.ТипУзла = ТипУзлаXML.НачалоЭлемента
				И ЧтениеXML.Имя = "condition" Тогда
			ЧтениеXML.Прочитать();
			Условие = ЧтениеXML.Значение;
		ИначеЕсли ЧтениеXML.ТипУзла = ТипУзлаXML.НачалоЭлемента
				И ЧтениеXML.Имя = "field" Тогда
			ЧтениеXML.Прочитать();
			МассивПолей.Добавить(ЧтениеXML.Значение);
		Иначе
			// Прочие узлы игнорируем
		КонецЕсли;

	КонецЦикла;

	Результат = Новый Структура;
	Результат.Вставить("Условие", Условие);
	Результат.Вставить("Поля",    СтрСоединить(МассивПолей, Символы.ПС));

	Возврат Результат;

КонецФункции

// Читает блок <restrictionTemplate> и добавляет шаблон в модель.
Процедура ПрочитатьШаблонXML(ЧтениеXML, Модель)

	ИмяШаблона   = "";
	ТекстШаблона = "";

	Пока ЧтениеXML.Прочитать() Цикл

		Если ЧтениеXML.ТипУзла = ТипУзлаXML.КонецЭлемента
				И ЧтениеXML.Имя = "restrictionTemplate" Тогда
			Прервать;
		КонецЕсли;

		Если ЧтениеXML.ТипУзла <> ТипУзлаXML.НачалоЭлемента Тогда
			Продолжить;
		КонецЕсли;

		Если ЧтениеXML.Имя = "name" Тогда
			ЧтениеXML.Прочитать();
			ИмяШаблона = ЧтениеXML.Значение;

		ИначеЕсли ЧтениеXML.Имя = "condition" Тогда
			ЧтениеXML.Прочитать();
			ТекстШаблона = ЧтениеXML.Значение;

		Иначе
			// Прочие элементы шаблона игнорируем

		КонецЕсли;

	КонецЦикла;

	НоваяСтрока = Модель.Шаблоны.Добавить();
	НоваяСтрока.ИмяШаблона   = ИмяШаблона;
	НоваяСтрока.ТекстШаблона = ТекстШаблона;

КонецПроцедуры

// Разбирает dot-нотацию имени объекта из Rights.xml на составляющие части.
//
// Примеры нотации:
//   "Catalog.Контрагенты"                              → ВидОбъекта=Catalog, ИмяОбъекта=Контрагенты
//   "Catalog.X.Attribute.ИНН"                          → +ТипРеквизита=Attribute, ИмяРеквизита=ИНН
//   "Document.X.TabularSection.Товары.Attribute.Ном"   → +ИмяРеквизитаТЧ=Товары, ИмяРеквизита=Ном
//
// Параметры:
//  ДотНотация     - Строка - полное имя объекта в dot-нотации
//  ВидОбъекта     - Строка - [вых] вид метаданных
//  ИмяОбъекта     - Строка - [вых] имя объекта метаданных
//  ТипРеквизита   - Строка - [вых] тип вложенного реквизита
//  ИмяРеквизита   - Строка - [вых] имя реквизита
//  ИмяРеквизитаТЧ - Строка - [вых] имя ТЧ (для вложенных реквизитов)
//
Процедура РазобратьДотНотацию(
		ДотНотация,
		ВидОбъекта,
		ИмяОбъекта,
		ТипРеквизита,
		ИмяРеквизита,
		ИмяРеквизитаТЧ)

	ВидОбъекта     = "";
	ИмяОбъекта     = "";
	ТипРеквизита   = "";
	ИмяРеквизита   = "";
	ИмяРеквизитаТЧ = "";

	Части = СтрРазделить(ДотНотация, ".", Ложь);
	КоличествоЧастей = Части.Количество();

	Если КоличествоЧастей < 2 Тогда
		Возврат;
	КонецЕсли;

	ВидОбъекта = Части[0];
	ИмяОбъекта = Части[1];

	Если КоличествоЧастей < 4 Тогда
		Возврат;
	КонецЕсли;

	ТипРеквизита = Части[2];

	// Document.X.TabularSection.ИмяТС.ТипРеквизита.ИмяРеквизита — 6 частей
	Если НРег(ТипРеквизита) = "tabularsection" И КоличествоЧастей >= 6 Тогда
		ИмяРеквизитаТЧ = Части[3];
		ТипРеквизита   = Части[4];
		ИмяРеквизита   = Части[5];
	Иначе
		// Catalog.X.Attribute.ИмяРеквизита — 4 части
		ИмяРеквизита = Части[3];
	КонецЕсли;

КонецПроцедуры

// Получает список имён ролей, входящих в профиль с указанным именем.
// При наличии справочника ПрофилиГруппДоступа — читает из него.
// При отсутствии БСП — интерпретирует ИмяПрофиля как имя роли конфигурации.
//
// Параметры:
//  ИмяПрофиля - Строка - наименование профиля или имя роли конфигурации
//
// Возвращаемое значение:
//  Массив - массив строк с именами ролей конфигурации
//
// Получает роли профиля групп доступа по ссылке.
//
// Параметры:
//  СсылкаПрофиля - СправочникСсылка - ссылка на элемент справочника ПрофилиГруппДоступа
//
// Возвращаемое значение:
//  Массив - массив строк с именами ролей конфигурации
//
Функция ПолучитьРолиПрофиля(СсылкаПрофиля)

	МассивРолей = Новый Массив;

	Если Метаданные.НайтиПоПолномуИмени("Справочник.ПрофилиГруппДоступа") = Неопределено Тогда
		Возврат МассивРолей;
	КонецЕсли;

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	РолиПрофиля.Роль.Имя КАК ИмяРоли
	|ИЗ
	|	Справочник.ПрофилиГруппДоступа.Роли КАК РолиПрофиля
	|ГДЕ
	|	РолиПрофиля.Ссылка = &Профиль";
	Запрос.УстановитьПараметр("Профиль", СсылкаПрофиля);

	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();

	Пока Выборка.Следующий() Цикл
		МассивРолей.Добавить(Выборка.ИмяРоли);
	КонецЦикла;

	Возврат МассивРолей;

КонецФункции

// Получает все роли пользователя через цепочку: Пользователь → ГруппыДоступа → Профиль → Роли.
//
// Параметры:
//  СсылкаПользователя - СправочникСсылка - ссылка на пользователя
//
// Возвращаемое значение:
//  Массив - массив строк с именами ролей конфигурации (без дублей)
//
Функция ПолучитьРолиПользователяЧерезПрофили(СсылкаПользователя)

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	РолиПрофиля.Роль.Имя КАК ИмяРоли
	|ИЗ
	|	Справочник.ГруппыДоступа.Пользователи КАК ПользователиГрупп
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ПрофилиГруппДоступа.Роли КАК РолиПрофиля
	|		ПО ПользователиГрупп.Ссылка.Профиль = РолиПрофиля.Ссылка
	|ГДЕ
	|	ПользователиГрупп.Пользователь = &Пользователь
	|	И НЕ ПользователиГрупп.Ссылка.ПометкаУдаления";
	Запрос.УстановитьПараметр("Пользователь", СсылкаПользователя);

	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();

	МассивРолей = Новый Массив;

	Пока Выборка.Следующий() Цикл
		МассивРолей.Добавить(Выборка.ИмяРоли);
	КонецЦикла;

	Возврат МассивРолей;

КонецФункции

// Объединяет права набора ролей конфигурации в единую модель по правилу OR.
// Для каждого уникального ключа права значение = Истина, если хотя бы одна роль его разрешает.
// Читает XML всех ролей одним запросом к регистру цур_XMLРолейКонфигурации.
//
// Параметры:
//  МассивИменРолей - Массив - массив строк с именами ролей конфигурации
//
// Возвращаемое значение:
//  Структура - объединённая модель роли, см. НовыеПараметрыРоли()
//
Функция ОбъединитьПраваРолей(МассивИменРолей)

	МодельАгрегат = НовыеПараметрыРоли();

	Если МассивИменРолей.Количество() = 0 Тогда
		Возврат МодельАгрегат;
	КонецЕсли;

	// Один запрос для всех ролей вместо N отдельных
	СоответствиеXML = ПолучитьXMLРолейПакетом(МассивИменРолей);

	ИндексПрав        = Новый Соответствие;
	ИндексОграничений = Новый Соответствие;
	ИндексШаблонов    = Новый Соответствие;

	Для Каждого ИмяРоли Из МассивИменРолей Цикл

		XMLТекст = СоответствиеXML.Получить(ИмяРоли);
		Если XMLТекст = Неопределено Или ПустаяСтрока(XMLТекст) Тогда
			Продолжить;
		КонецЕсли;

		МодельТекущей = НовыеПараметрыРоли();
		МодельТекущей.Имя = ИмяРоли;
		ПрочитатьМодельИзXML(ИмяРоли, XMLТекст, МодельТекущей);

		МодельАгрегат.УстанавливатьДляНовыхОбъектов = МодельАгрегат.УстанавливатьДляНовыхОбъектов
			Или МодельТекущей.УстанавливатьДляНовыхОбъектов;

		МодельАгрегат.НезависимыеПраваПодчиненных = МодельАгрегат.НезависимыеПраваПодчиненных
			Или МодельТекущей.НезависимыеПраваПодчиненных;

		ОбъединитьТаблицуПрав(МодельАгрегат.Права, МодельТекущей.Права, ИндексПрав);
		ОбъединитьТаблицуОграничений(МодельАгрегат.Ограничения, МодельТекущей.Ограничения, ИндексОграничений);
		ОбъединитьТаблицуШаблонов(МодельАгрегат.Шаблоны, МодельТекущей.Шаблоны, ИндексШаблонов);

	КонецЦикла;

	Возврат МодельАгрегат;

КонецФункции

// Объединяет таблицу прав в агрегат по правилу OR для ЗначениеПрава.
// Использует индекс для O(1) поиска дублей.
Процедура ОбъединитьТаблицуПрав(ТаблицаАгрегат, ТаблицаИсточник, ИндексПрав)

	Для Каждого Строка Из ТаблицаИсточник Цикл
		Ключ = СтрШаблон("%1|%2|%3|%4|%5",
			Строка.ВидОбъекта,
			Строка.ИмяОбъекта,
			Строка.ИмяПрава,
			Строка.ТипРеквизита,
			Строка.ИмяРеквизита);

		СуществующаяСтрока = ИндексПрав.Получить(Ключ);
		Если СуществующаяСтрока <> Неопределено Тогда
			СуществующаяСтрока.ЗначениеПрава = СуществующаяСтрока.ЗначениеПрава Или Строка.ЗначениеПрава;
		Иначе
			НоваяСтрока = ТаблицаАгрегат.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка);
			ИндексПрав.Вставить(Ключ, НоваяСтрока);
		КонецЕсли;

	КонецЦикла;

КонецПроцедуры

// Объединяет таблицу ограничений в агрегат, добавляя первое встречное условие по ключу объект+право.
Процедура ОбъединитьТаблицуОграничений(ТаблицаАгрегат, ТаблицаИсточник, ИндексОграничений)

	Для Каждого Строка Из ТаблицаИсточник Цикл
		Ключ = СтрШаблон("%1|%2|%3",
			Строка.ВидОбъекта,
			Строка.ИмяОбъекта,
			Строка.ИмяПрава);

		Если ИндексОграничений.Получить(Ключ) = Неопределено Тогда
			НоваяСтрока = ТаблицаАгрегат.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка);
			ИндексОграничений.Вставить(Ключ, Истина);
		КонецЕсли;

	КонецЦикла;

КонецПроцедуры

// Объединяет таблицу шаблонов в агрегат, пропуская дубли по ИмяШаблона.
Процедура ОбъединитьТаблицуШаблонов(ТаблицаАгрегат, ТаблицаИсточник, ИндексШаблонов)

	Для Каждого Строка Из ТаблицаИсточник Цикл
		Если ИндексШаблонов.Получить(Строка.ИмяШаблона) = Неопределено Тогда
			НоваяСтрока = ТаблицаАгрегат.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка);
			ИндексШаблонов.Вставить(Строка.ИмяШаблона, Истина);
		КонецЕсли;
	КонецЦикла;

КонецПроцедуры

// Читает и разбирает модель роли конфигурации из XML регистра цур_XMLРолейКонфигурации.
//
// Параметры:
//  ИмяРоли - Строка - имя роли в конфигурации
//
// Возвращаемое значение:
//  Структура, Неопределено - модель роли или Неопределено, если XML не найден
//
// Устаревшая — используется экспортная ПолучитьМодельРолиКонфигурации из ПрограммныйИнтерфейс

// Записывает набор прав в регистр цур_ПраваДоступа (очистка + запись).
Процедура ЗаписатьТаблицуВРегистрПрав(СсылкаРоли, ТаблицаПрав)

	НаборЗаписей = РегистрыСведений.цур_ПраваДоступа.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Роль.Установить(СсылкаРоли);

	Для Каждого Строка Из ТаблицаПрав Цикл
		НоваяЗапись = НаборЗаписей.Добавить();
		НоваяЗапись.Роль             = СсылкаРоли;
		НоваяЗапись.ВидОбъекта       = Строка.ВидОбъекта;
		НоваяЗапись.ИмяОбъекта       = Строка.ИмяОбъекта;
		НоваяЗапись.ИмяПрава         = Строка.ИмяПрава;
		НоваяЗапись.ТипРеквизита     = Строка.ТипРеквизита;
		НоваяЗапись.ИмяРеквизита     = Строка.ИмяРеквизита;
		НоваяЗапись.ИмяРеквизитаТЧ   = Строка.ИмяРеквизитаТЧ;
		НоваяЗапись.ЗначениеПрава    = Строка.ЗначениеПрава;
	КонецЦикла;

	НаборЗаписей.Записать();

КонецПроцедуры

// Записывает набор ограничений в регистр цур_ОграниченияДоступа (очистка + запись).
Процедура ЗаписатьТаблицуВРегистрОграничений(СсылкаРоли, ТаблицаОграничений) Экспорт

	НаборЗаписей = РегистрыСведений.цур_ОграниченияДоступа.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Роль.Установить(СсылкаРоли);

	Для Каждого Строка Из ТаблицаОграничений Цикл
		НоваяЗапись = НаборЗаписей.Добавить();
		НоваяЗапись.Роль               = СсылкаРоли;
		НоваяЗапись.ВидОбъекта         = Строка.ВидОбъекта;
		НоваяЗапись.ИмяОбъекта         = Строка.ИмяОбъекта;
		НоваяЗапись.ИмяПрава           = Строка.ИмяПрава;
		НоваяЗапись.УсловиеОграничения = Строка.УсловиеОграничения;

		Попытка
			НоваяЗапись.Поля = Строка.Поля;
		Исключение
			// Колонка Поля отсутствует в источнике — пропускаем
		КонецПопытки;

	КонецЦикла;

	НаборЗаписей.Записать();

КонецПроцедуры

// Записывает набор шаблонов в регистр цур_ШаблоныОграничений (очистка + запись).
Процедура ЗаписатьТаблицуВРегистрШаблонов(СсылкаРоли, ТаблицаШаблонов) Экспорт

	НаборЗаписей = РегистрыСведений.цур_ШаблоныОграничений.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Роль.Установить(СсылкаРоли);

	Для Каждого Строка Из ТаблицаШаблонов Цикл
		НоваяЗапись = НаборЗаписей.Добавить();
		НоваяЗапись.Роль         = СсылкаРоли;
		НоваяЗапись.ИмяШаблона   = Строка.ИмяШаблона;
		НоваяЗапись.ТекстШаблона = Строка.ТекстШаблона;
	КонецЦикла;

	НаборЗаписей.Записать();

КонецПроцедуры

// Записывает список подсистем в регистр цур_ПодсистемыРолей (очистка + запись).
Процедура ЗаписатьПодсистемыРоли(СсылкаРоли, МассивПодсистем)

	НаборЗаписей = РегистрыСведений.цур_ПодсистемыРолей.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Роль.Установить(СсылкаРоли);

	Для Каждого ПолноеИмяПодсистемы Из МассивПодсистем Цикл
		НоваяЗапись = НаборЗаписей.Добавить();
		НоваяЗапись.Роль                 = СсылкаРоли;
		НоваяЗапись.ПолноеИмяПодсистемы = ПолноеИмяПодсистемы;
	КонецЦикла;

	НаборЗаписей.Записать();

КонецПроцедуры

#КонецОбласти
